In [1]:
people = {
    "first":['Ali','Jane','Jhon'],
    "last":['Raza','Doe','Doe'],
    "email":['aliraza@gmail.com','janeDoe@gmail.com','JhonDoe@hotmail.com']
}

In [75]:
import pandas as pd
import numpy as np

In [39]:
df = pd.DataFrame(people)

## Updating Rows and Columns

In [4]:
df

  first  last                email
0   Ali  Raza    aliraza@gmail.com
1  Jane   Doe    janeDoe@gmail.com
2  Jhon   Doe  JhonDoe@hotmail.com

In [5]:
df.columns = ['first_name','last_name','email']

In [6]:
df

  first_name last_name                email
0        Ali      Raza    aliraza@gmail.com
1       Jane       Doe    janeDoe@gmail.com
2       Jhon       Doe  JhonDoe@hotmail.com

In [7]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                EMAIL
0        Ali      Raza    aliraza@gmail.com
1       Jane       Doe    janeDoe@gmail.com
2       Jhon       Doe  JhonDoe@hotmail.com

In [8]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                email
0        Ali      Raza    aliraza@gmail.com
1       Jane       Doe    janeDoe@gmail.com
2       Jhon       Doe  JhonDoe@hotmail.com

In [9]:
df.rename(columns = {'first_name':'first', 'last_name':'last'}, inplace = True)
df

  first  last                email
0   Ali  Raza    aliraza@gmail.com
1  Jane   Doe    janeDoe@gmail.com
2  Jhon   Doe  JhonDoe@hotmail.com

In [10]:
df.loc[2] = ['Jhon','Smith','JhonSmith@email.com']

In [11]:
df.loc[2]

first                   Jhon
last                   Smith
email    JhonSmith@email.com
Name: 2, dtype: object

In [12]:
df.loc[2,['last','email']] = ['Doe','jhondoe@gmail.com']

In [13]:
df

  first  last              email
0   Ali  Raza  aliraza@gmail.com
1  Jane   Doe  janeDoe@gmail.com
2  Jhon   Doe  jhondoe@gmail.com

In [14]:
df['email']= df['email'].str.lower()

In [15]:
df

  first  last              email
0   Ali  Raza  aliraza@gmail.com
1  Jane   Doe  janedoe@gmail.com
2  Jhon   Doe  jhondoe@gmail.com

### apply

In [16]:
df['email'].apply(len)

0    17
1    17
2    17
Name: email, dtype: int64

In [17]:
def update_email(email):
    return email.upper()

In [18]:
df['email'].apply(update_email)

0    ALIRAZA@GMAIL.COM
1    JANEDOE@GMAIL.COM
2    JHONDOE@GMAIL.COM
Name: email, dtype: object

In [19]:
df['email'] = df['email'].apply(update_email)

In [20]:
df

  first  last              email
0   Ali  Raza  ALIRAZA@GMAIL.COM
1  Jane   Doe  JANEDOE@GMAIL.COM
2  Jhon   Doe  JHONDOE@GMAIL.COM

In [21]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [22]:
df

  first  last              email
0   Ali  Raza  aliraza@gmail.com
1  Jane   Doe  janedoe@gmail.com
2  Jhon   Doe  jhondoe@gmail.com

In [23]:
df.apply(pd.Series.min)

first                  Ali
last                   Doe
email    aliraza@gmail.com
dtype: object

In [24]:
df.apply(lambda x: x.min())

first                  Ali
last                   Doe
email    aliraza@gmail.com
dtype: object

In [32]:
# Series Object Don't have 'applymap' method. i.e

df.apply(len)

first    3
last     3
email    3
dtype: int64

### applymap

In [26]:
df.applymap(len)

   first  last  email
0      3     4     17
1      4     3     17
2      4     3     17

In [31]:
df.applymap(str.lower)

  first  last              email
0   ali  raza  aliraza@gmail.com
1  jane   doe  janedoe@gmail.com
2  jhon   doe  jhondoe@gmail.com

### map

In [35]:
df

  first  last              email
0   Ali  Raza  aliraza@gmail.com
1  Jane   Doe  janedoe@gmail.com
2  Jhon   Doe  jhondoe@gmail.com

In [36]:
df['first'].map({'Ali':'Ahmad','Jane':'Koe'})

0    Ahmad
1      Koe
2      NaN
Name: first, dtype: object

In [37]:
# In order to avoid 'NaN' we can still change the only values we want by 'replace' method. i.e

### replace

In [38]:
df['first'].replace({'Ali':'Ahmad','Jane':'Koe'})

0    Ahmad
1      Koe
2     Jhon
Name: first, dtype: object

## Adding Rows & Columns

In [40]:
df['first'] + ' ' + df['last']

0    Ali Raza
1    Jane Doe
2    Jhon Doe
dtype: object

In [41]:
df['full_name'] = df['first'] + ' ' + df['last']  # Adding a Column

In [42]:
df

  first  last                email full_name
0   Ali  Raza    aliraza@gmail.com  Ali Raza
1  Jane   Doe    janeDoe@gmail.com  Jane Doe
2  Jhon   Doe  JhonDoe@hotmail.com  Jhon Doe

In [46]:
df.drop(columns = ['first','last'], inplace = True)

In [47]:
df

                 email full_name
0    aliraza@gmail.com  Ali Raza
1    janeDoe@gmail.com  Jane Doe
2  JhonDoe@hotmail.com  Jhon Doe

In [49]:
df['full_name'].str.split(' ', expand = True)

      0     1
0   Ali  Raza
1  Jane   Doe
2  Jhon   Doe

In [50]:
df[['first','last']] = df['full_name'].str.split(' ', expand = True)

In [51]:
df

                 email full_name first  last
0    aliraza@gmail.com  Ali Raza   Ali  Raza
1    janeDoe@gmail.com  Jane Doe  Jane   Doe
2  JhonDoe@hotmail.com  Jhon Doe  Jhon   Doe

In [52]:
# To add a single Row

In [58]:
df.append({'first':"Tony", 'last':'Stark'}, ignore_index= True)

                 email full_name first   last
0    aliraza@gmail.com  Ali Raza   Ali   Raza
1    janeDoe@gmail.com  Jane Doe  Jane    Doe
2  JhonDoe@hotmail.com  Jhon Doe  Jhon    Doe
3                  NaN       NaN  Tony  Stark

In [62]:
 # We can aslo add another 'DataFrame' by append method we used above.
df

                 email full_name first  last
0    aliraza@gmail.com  Ali Raza   Ali  Raza
1    janeDoe@gmail.com  Jane Doe  Jane   Doe
2  JhonDoe@hotmail.com  Jhon Doe  Jhon   Doe

In [63]:
df.drop(index = 2)

               email full_name first  last
0  aliraza@gmail.com  Ali Raza   Ali  Raza
1  janeDoe@gmail.com  Jane Doe  Jane   Doe

In [64]:
df

                 email full_name first  last
0    aliraza@gmail.com  Ali Raza   Ali  Raza
1    janeDoe@gmail.com  Jane Doe  Jane   Doe
2  JhonDoe@hotmail.com  Jhon Doe  Jhon   Doe

In [65]:
filt = df['last'] == 'Doe'

In [66]:
df.drop(df[filt].index)

               email full_name first  last
0  aliraza@gmail.com  Ali Raza   Ali  Raza

## Sorting

In [67]:
df

                 email full_name first  last
0    aliraza@gmail.com  Ali Raza   Ali  Raza
1    janeDoe@gmail.com  Jane Doe  Jane   Doe
2  JhonDoe@hotmail.com  Jhon Doe  Jhon   Doe

In [70]:
df.sort_values(by = 'last', ascending = False)

                 email full_name first  last
0    aliraza@gmail.com  Ali Raza   Ali  Raza
1    janeDoe@gmail.com  Jane Doe  Jane   Doe
2  JhonDoe@hotmail.com  Jhon Doe  Jhon   Doe

In [71]:
df.sort_values(by = ['last','first'], ascending = [False,Tdrue])

                 email full_name first  last
0    aliraza@gmail.com  Ali Raza   Ali  Raza
1    janeDoe@gmail.com  Jane Doe  Jane   Doe
2  JhonDoe@hotmail.com  Jhon Doe  Jhon   Doe

In [72]:
df.sort_index()

                 email full_name first  last
0    aliraza@gmail.com  Ali Raza   Ali  Raza
1    janeDoe@gmail.com  Jane Doe  Jane   Doe
2  JhonDoe@hotmail.com  Jhon Doe  Jhon   Doe

In [73]:
df['last'].sort_values()

1     Doe
2     Doe
0    Raza
Name: last, dtype: object

In [74]:
df

                 email full_name first  last
0    aliraza@gmail.com  Ali Raza   Ali  Raza
1    janeDoe@gmail.com  Jane Doe  Jane   Doe
2  JhonDoe@hotmail.com  Jhon Doe  Jhon   Doe